In [0]:
import pandas as pd
import numpy as np

In [0]:
# Dept dataframe creation:

data = [[1,'HR','Bangalore'],[5,'HR','Delhi'],[3,'Manager','Bangalore'],[4,'Manager','Delhi']]

dept = pd.DataFrame(data, columns = ['Deptno','Dname','Loc'])

dept

   Deptno    Dname        Loc
0       1       HR  Bangalore
1       5       HR      Delhi
2       3  Manager  Bangalore
3       4  Manager      Delhi

In [0]:
# Emp dataframe creation:

data = [[1,5,49000],[2,6,45000],[3,8,60000],[4,7,55000]]

emp = pd.DataFrame(data, columns = ['Deptno','Eno','Sal'])

emp

   Deptno  Eno    Sal
0       1    5  49000
1       2    6  45000
2       3    8  60000
3       4    7  55000

In [0]:
# Inner join
join_inner = pd.merge(dept, emp, on='Deptno', how='inner')
join_inner

   Deptno    Dname        Loc  Eno    Sal
0       1       HR  Bangalore    5  49000
1       3  Manager  Bangalore    8  60000
2       4  Manager      Delhi    7  55000

In [0]:
# Leftouter join
join_leftouter = pd.merge(dept, emp, on='Deptno', how='left')
join_leftouter

   Deptno    Dname        Loc  Eno      Sal
0       1       HR  Bangalore  5.0  49000.0
1       5       HR      Delhi  NaN      NaN
2       3  Manager  Bangalore  8.0  60000.0
3       4  Manager      Delhi  7.0  55000.0

In [0]:
# Rightouter join
join_rightouter = pd.merge(dept, emp, on='Deptno', how='right')
join_rightouter

   Deptno    Dname        Loc  Eno    Sal
0       1       HR  Bangalore    5  49000
1       3  Manager  Bangalore    8  60000
2       4  Manager      Delhi    7  55000
3       2      NaN        NaN    6  45000

In [0]:
# Fullouter join
join_fullouter = pd.merge(dept, emp, on='Deptno', how='outer')
join_fullouter

   Deptno    Dname        Loc  Eno      Sal
0       1       HR  Bangalore  5.0  49000.0
1       5       HR      Delhi  NaN      NaN
2       3  Manager  Bangalore  8.0  60000.0
3       4  Manager      Delhi  7.0  55000.0
4       2      NaN        NaN  6.0  45000.0